#include <iostream>

int main() {
    std::cout << "Проверьте, можно ли первую коробку положить внутрь второй." << "\n";
    int a;
    int b;
    int c;
    std::cout << "Введите размер первой коробки: \n";
    std::cin >> a >> b >> c;

    int m;
    int n;
    int k;
    std::cout << "Введите размер второй коробки:\n";
    std::cin >> m >> n >> k;

    if ((a <= m && b <= n && c <= k) ||
        (a <= m && b <= k && c <= n) ||
        (a <= n && b <= m && c <= k) ||
        (a <= n && b <= k && c <= m) ||
        (a <= k && b <= m && c <= n) ||
        (a <= k && b <= n && c <= m)) {
        std::cout << "Первую коробку можно положить внутрь второй." << "\n";
    } else {
        std::cout << "Первую коробку нельзя положить внутрь второй." << "\n";
    }

    return 0;
}
