#include <iostream> 

int main()
{
    std::cout << "--------------------------------------------------------" << "\n";
    std::cout << "Калькулятор стоимости товара с учетом доставки и скидки." << "\n";
    std::cout << "--------------------------------------------------------" << "\n"; 
    std::cout << "Введите стоимость товара: ";
    int a;
    std::cin  >> a;
    std::cout << "Вы ввели: " << a << " рублей." << "\n";;
    std::cout << "----------" << "\n";
    std::cout << "Введите стоимость доставки:";
    int b;
    std::cin  >> b;
    std::cout << "Вы ввели: " << b << " рублей." << "\n";
    std::cout << "----------" << "\n";
    std::cout << "Введите размер скидки: ";
    int c;
    std::cin  >> c;
    std::cout << "Вы ввели: " << c << " рублей." << "\n";
    std::cout << "----------" << "\n";
    std::cout << "Рассчитываем стоимость..." << "\n";
    int fullPrice = a + b - c;
    std::cout << "----------------------------------------------------------------------------" << "\n";
    std::cout << "Полная стоимость товара с учетом доставки и скидки составляет: " << fullPrice << " рублей." << "\n";
    std::cout << "----------------------------------------------------------------------------" << "\n"; 
}