#include <iostream>

int main() {
  std::cout << "Ознакомьтесь с меню бизнес-ланча в зависимости от дня недели!" << "\n";
  int day;

	std::string numberToWord[] = {
		"понедельник",  // 1
		"вторник",   // 2
		"среда",   // 3
		"четверг",// 4
		"пятница",  // 5
		"суббота", // 6
		"воскресенье"  // 7
	};

		while (true) {
			while (true) { // ограничиваем ввод от 1 до 7
					std::cout << "Введите день недели (от 1 до 7): ";
					std::cin >> day;
						if (day >= 1 && day <= 7) {
							break; // выходим из цикла при корректном значении
						} else {
								std::cout << "Вы ввели неверный день недели. Пожалуйста, введите числа от 1 до 7!" << "\n";
						}
			}

			std::cout << "-----------------------------" << "\n";
			std::cout << "Меню сегодня (" << numberToWord[day - 1] << "): " << "\n"; // делаем [day -1] потому что исчисленние начинается с 0

			if (day == 1) {
					std::cout << "1. Суп гороховый" << "\n";
					std::cout << "2. Салат «Мимоза»" << "\n";
					std::cout << "3. Гречка с сосиской" << "\n";
					std::cout << "4. Чай" << "\n";
			} else if (day == 2) {
					std::cout << "1. Харчо" << "\n";
					std::cout << "2. Салат «Оливье»" << "\n";
					std::cout << "3. Баварские колбаски с капустой" << "\n";
					std::cout << "4. Морс" << "\n";
			} else if (day == 3) {
					std::cout << "1. Суп «Уха»" << "\n";
					std::cout << "2. Салат «Сельдь под шубой»" << "\n";
					std::cout << "3. Плов" << "\n";
					std::cout << "3. Морс" << "\n";
			} else if (day == 4) {
					std::cout << "1. Суп «Гороховый»" << "\n";
					std::cout << "2. Салат «Цезарь» с креветками" << "\n";
					std::cout << "3. Куриная ножка с пюре" << "\n";
					std::cout << "4. Морс" << "\n";
			} else if (day == 5) {
					std::cout << "1. Рыба в сметане" << "\n";
					std::cout << "2. Салат «Сельдь под шубой»" << "\n";
					std::cout << "2. Картофель фри" << "\n";
					std::cout << "3. Сок" << "\n";
			} else if (day == 6) {
					std::cout << "1. Суп «Гороховый»" << "\n";
					std::cout << "2. Салат «Оливье»" << "\n";
					std::cout << "3. Рис с курицей" << "\n";
					std::cout << "3. Сок" << "\n";
			} else if (day == 7) {
					std::cout << "1. Суп «Рассольник»" << "\n";
					std::cout << "2. Салат «Сельдь под шубой" << "\n";
					std::cout << "2. Каша с молоком" << "\n";
					std::cout << "3. Чай" << "\n";
			}

			std::cout << "-----------------------------" << "\n";
			std::cout << "Хотите выбрать другой день?" << "\n";
			int answer;

			while (true) { // ограничиваем ввод от 1 до 2
				std::cout << "Введите ответ (1-Да; 2-Нет): ";
				std::cin >> answer;
					if (answer == 2) {
						std::cout << "Хорошо! Увидимся в следующий раз!" << "\n";
						exit(0);
					} else if (answer == 1) {
						std::cout << "Отлично! Давайте продолжим!" << "\n";
						break; // выходим из цикла и возвращаемся в предыдущий цикл
					} else {
						std::cout << "Вы ввели неверный ответ. Пожалуйста, введите числа от 1 до 2!" << "\n";
					}
			}
		}
}